# config.py
# تنظیمات اصلی ربات دیوار

CATEGORIES = [
    {"category": "apartment-sell", "label": "فروش آپارتمان"},
    {"category": "apartment-rent", "label": "رهن و اجاره آپارتمان"},
    {"category": "house-villa-sell", "label": "فروش خانه/ویلایی/کلنگی"},
    {"category": "house-villa-rent", "label": "رهن و اجاره خانه/ویلایی"},
]

TARGET_DISTRICTS = [
    "اقبال", "شهرآرا", "صیاد", "نیرو", "هنرستان",
    "هاشمیه", "هفت تیر", "نه دره", "وکیل", "کوثر",
    "چهارچشمه", "سرافرازان", "رضاشهر", "آزادشهر", "زیباشهر",
    "سیدرضی", "فرهنگ", "دانشجو", "تربیت", "شریف",
    "فارغ التحصیلان", "ارمغان", "پردیس", "ویلاشهر"
]

AGENCY_KEYWORDS = [
    "مشاور", "مشاوره", "تیم مشاور", "دفتر املاک", "املاک",
    "بنگاه", "هلدینگ", "دپارتمان", "مستغلات", "گروه املاک",
    "آژانس", "بازار مسکن", "کارشناس فروش", "واحد فروش",
    "بی واسطه","بی‌واسطه","همخانه","هم خانه","همخونه","به دنبال همخونه هستم","جویای خونه ام","مسکن", "دفتر"
]

MAX_PER_RUN = 50
DELAY_BETWEEN_POSTS = 8
CITY_ID = "3"
